# UNIX
brew "git"
brew "openssl"
brew "tmux"
brew "vim"
brew "zsh"
brew "htop"
brew "tree"
brew "mas"

# Software
cask "dropbox"
cask "flux"
cask "spotify"
cask "tunnelblick"
cask "vlc"
mas "Divvy", id: 413857545
mas "The Unarchiver", id: 425424353

# Image manipulation
brew "imagemagick"

# Testing
brew "qt"

# Programming languages
brew "libyaml" # should come after openssl
brew "node"
brew "rbenv"
brew "ruby-build"

# Databases
brew "postgres", restart_service: true
brew "redis", restart_service: true

# Other
brew "dark-mode"
