# UNIX
brew "git"
brew "openssl"
brew "tmux"
brew "vim"
brew "zsh"
brew "htop"
brew "tree"
brew "watch"
brew "wget"

# Software
cask "flux"
cask "spotify"
cask "vlc"

# Image manipulation
brew "imagemagick"

# Testing
# brew "qt" -> currently broken on Sierra

# Programming languages
brew "libyaml" # should come after openssl
brew "node"
brew "rbenv"
brew "ruby-build"

# Databases
brew "postgres", restart_service: true
brew "redis", restart_service: true
